Validation/cylinder_array_2d/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /   A nd           | Version:  13
     \\/    M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solver          pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10.0;

deltaT          0.001;

writeControl    runTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    probes
    {
        type            probes;
        libs            ("libsampling.so");
        writeControl    timeStep;
        writeInterval   1;
        fields          (U p);
        probeLocations
        (
            (0.015 0.005 0)   // behind cylinder, upper shear layer
            (0.025 0.005 0)   // further downstream
            (0.015 0.0 0)     // wake centreline
        );
    }

    #includeFunc forcesIncompressible
    #includeFunc forceCoeffsIncompressible
}

// ************************************************************************* //
